<?php

namespace Database\Seeders;

use App\Models\Analysis;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class AnalysisSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $analyses = [
            [
                'name' => 'Загальний аналіз крові',
                'description' => 'Аналіз для оцінки загального стану здоров\'я і виявлення різних захворювань.',
                'price' => 150.00,
            ],
            [
                'name' => 'Біохімічний аналіз крові',
                'description' => 'Дозволяє оцінити роботу внутрішніх органів, таких як печінка та нирки.',
                'price' => 300.00,
            ],
            [
                'name' => 'Аналіз сечі',
                'description' => 'Для оцінки функції нирок і виявлення інфекцій сечовивідних шляхів.',
                'price' => 100.00,
            ],
            [
                'name' => 'Аналіз на цукор',
                'description' => 'Вимірювання рівня глюкози в крові для діагностики цукрового діабету.',
                'price' => 200.00,
            ],
            [
                'name' => 'Гормональний аналіз',
                'description' => 'Перевірка рівня гормонів в організмі для діагностики ендокринних захворювань.',
                'price' => 500.00,
            ],
            [
                'name' => 'Аналіз на інфекції',
                'description' => 'Дозволяє виявити бактеріальні чи вірусні інфекції в організмі.',
                'price' => 400.00,
            ],
            [
                'name' => 'Аналіз калу',
                'description' => 'Перевірка функціонування травної системи і наявності паразитів.',
                'price' => 120.00,
            ],
            [
                'name' => 'Коагулограма',
                'description' => 'Дослідження згортання крові для оцінки ризику тромбозів.',
                'price' => 250.00,
            ],
            [
                'name' => 'Аналіз на холестерин',
                'description' => 'Вимірювання рівня холестерину в крові для оцінки ризику серцево-судинних захворювань.',
                'price' => 180.00,
            ],
            [
                'name' => 'Імунологічний аналіз',
                'description' => 'Перевірка стану імунної системи.',
                'price' => 600.00,
            ],
        ];

        foreach ($analyses as $analysis) {
            Analysis::create($analysis);
        }
    }
}
