<?php

namespace Database\Seeders;

use App\Models\Diagnosis;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class DiagnosisSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $diagnoses = [
            [
                'name' => 'Грип',
                'description' => 'Вірусна інфекція, яка вражає дихальні шляхи.',
            ],
            [
                'name' => 'Ангина',
                'description' => 'Інфекційне захворювання, яке характеризується запаленням мигдаликів.',
            ],
            [
                'name' => 'Бронхіт',
                'description' => 'Запалення бронхів, що викликає кашель і утруднене дихання.',
            ],
            [
                'name' => 'Пневмонія',
                'description' => 'Запалення легень, яке часто викликається бактеріальною інфекцією.',
            ],
            [
                'name' => 'Гастрит',
                'description' => 'Запалення слизової оболонки шлунка, що викликає дискомфорт у животі.',
            ],
            [
                'name' => 'Артеріальна гіпертензія',
                'description' => 'Підвищений артеріальний тиск, який може викликати серцеві та судинні захворювання.'
            ],
            [
                'name' => 'Цукровий діабет',
                'description' => 'Хронічне захворювання, що характеризується високим рівнем цукру в крові.'
            ],
            [
                'name' => 'Анемія',
                'description' => 'Стан, при якому в крові недостатньо еритроцитів або гемоглобіну.'
            ],
            [
                'name' => 'Ішемічна хвороба серця'
            ],
            [
                'name' => 'Інсульт',
                'description' => 'Порушення кровообігу мозку, що може призвести до паралічу.'
            ],
            [
                'name' => 'Хронічний бронхіт',
                'description' => 'Тривале запалення бронхів, яке викликає кашель та задишку.'
            ],
            [
                'name' => 'Артрит',
                'description' => 'Запальне захворювання суглобів, що викликає біль та набряк.'
            ],
            [
                'name' => 'Гастроезофагеальна рефлюксна хвороба (ГЕРХ)',
                'description' => 'Хвороба, при якій шлунковий вміст піднімається в стравохід.'
            ],
            [
                'name' => 'Гіпотиреоз',
                'description' => 'Стан, при якому щитоподібна залоза не виробляє достатньо гормонів.'
            ],
            [
                'name' => 'Мігрень',
                'description' => 'Хронічний головний біль, який часто супроводжується нудотою та чутливістю до світла.'
            ],
            [
                'name' => 'Хронічний синусит'
            ],
            [
                'name' => 'Панкреатит',
                'description' => 'Запалення підшлункової залози.'
            ],
            [
                'name' => 'Остеопороз',
                'description' => 'Зниження щільності кісток, що призводить до їх ламкості.'
            ],
            [
                'name' => 'Атопічний дерматит',
                'description' => 'Хронічне запалення шкіри, що викликає свербіж і почервоніння.'
            ],
            [
                'name' => 'Хвороба Паркінсона',
                'description' => 'Прогресуюче нейродегенеративне захворювання, що викликає тремор і порушення рухів.'
            ],
            [
                'name' => 'Хвороба Альцгеймера',
                'description' => 'Нейродегенеративне захворювання, що призводить до втрати пам’яті та інших когнітивних функцій.'
            ],
            [
                'name' => 'Подагра',
                'description' => 'Запалення суглобів через накопичення сечової кислоти.'
            ],
            [
                'name' => 'Гіпертрофія простати'
            ],
            [
                'name' => 'Цистит',
                'description' => 'Запалення сечового міхура, що викликає біль та часті сечовипускання.'
            ],
            [
                'name' => 'Епілепсія',
                'description' => 'Неврологічне захворювання, що викликає епілептичні напади.'
            ],
            [
                'name' => 'Хронічний біль у спині'
            ],
            [
                'name' => 'Кільцева алопеція',
                'description' => 'Автоімунне захворювання, що викликає випадіння волосся.'
            ],
            [
                'name' => 'Алергічний риніт',
                'description' => 'Запалення слизової оболонки носа через алергію.'
            ],
            [
                'name' => 'Фіброміалгія'
            ],
            [
                'name' => 'Рак легень'
            ],
            [
                'name' => 'Рак молочної залози'
            ],
            [
                'name' => 'Цироз печінки',
                'description' => 'Прогресуюче захворювання печінки, що призводить до її пошкодження.'
            ],
            [
                'name' => 'Хвороба Крона',
                'description' => 'Запальне захворювання кишківника, яке може вражати будь-яку частину травного тракту.'
            ],
            [
                'name' => 'Меланома',
                'description' => 'Рак шкіри, який розвивається з меланоцитів.'
            ],
            [
                'name' => 'Синдром роздратованого кишківника',
                'description' => 'Порушення функції товстого кишківника, що викликає дискомфорт у животі.'
            ]
        ];

        foreach ($diagnoses as $diagnosis) {
            Diagnosis::create($diagnosis);
        }
    }
}
